<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002, Spring, 2020</span><br>
</center></b>
<br><br>
<i><center>
<span style="font-size: 20pt; line-height: 1.2;">Lecture 5: Advanced SQL, Projects</span>
</center></i>

__Note:__ Modifying width of cells for wider displays.

# Lecture Material

- The [lecture slides](https://github.com/donald-f-ferguson/W4111_S21/blob/main/Lectures/Lecture_1_Introduction_Foundations/Lecture_1_Introduction_Foundations.pptx) contain the lecture material, slides, etc.


- The Jupyter notebook is for running example code and sample applications.

# Set Up Environment

In [73]:
load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [74]:
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahmansbaseballdb

'Connected: dbuser@lahmansbaseballdb'

# CourseWorks and Homework Questions

# Constraints

In [3]:
%sql use aaaa_simple_university;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

In [27]:
%sql show create table university_faculty;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('university_faculty', "CREATE TABLE `university_faculty` (\n  `guid` varchar(256) NOT NULL,\n  `first_name` varchar(128) NOT NULL,\n  `last_name` varchar(128) NOT NULL,\n   ... (781 characters truncated) ... email` like _utf8mb4'%@%') and (not((`preferred_email` like _utf8mb4'%@%@%'))))))\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci")]

- That formatting is kind of icky because it formats as a Markdown table.


- A better version. Copy the create statement. A little better.

```
CREATE TABLE `university_faculty` (
  `guid` varchar(256) NOT NULL,
  `first_name` varchar(128) NOT NULL,
  `last_name` varchar(128) NOT NULL,
  `preferred_email` varchar(256) DEFAULT NULL,
  `title` enum('Adjunct Professor','Associate Professor',
      'Assistant Professor','Professor','Professor of Practice','Lecturer','Senior Lecturer') NOT NULL,
  `hire_year` varchar(32) NOT NULL,
  `uni` varchar(12) NOT NULL,
  `IQ` int DEFAULT NULL,
  `uni_email` varchar(256) GENERATED ALWAYS AS (concat(`uni`,_utf8mb4'@columbia.edu')) STORED,
  `preferred_name` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`guid`),
  UNIQUE KEY `uni_UNIQUE` (`uni`),
  UNIQUE KEY `uni_email_UNIQUE` (`uni_email`),
  CONSTRAINT `university_faculty_chk_1` CHECK ((((`IQ` > 0) and (`IQ` <= 200)) AND 
	((if(last_name='Ferguson',50,200) >= iq)))),
  CONSTRAINT `university_faculty_chk_2` CHECK ((preferred_email is NULL) OR
			((`preferred_email` like _utf8mb4'%@%') and (not((`preferred_email` like _utf8mb4'%@%@%')))))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;


```

- Let's try some stuff.

In [24]:
try:
    %sql insert into university_faculty \
        (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name) \
        values ('123', 'Donald', 'Ferguson', 'someemail', 'Adjunct Professor', '2010', 'dff9', 49, 'Ferg')
    print("Inserted")
except Exception as e:
    print("Got exception = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception =  (pymysql.err.InternalError) (3819, "Check constraint 'university_faculty_chk_2' is violated.")
[SQL: insert into university_faculty          (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name)          values ('123', 'Donald', 'Ferguson', 'someemail', 'Adjunct Professor', '2010', 'dff9', 49, 'Ferg')]
(Background on this error at: http://sqlalche.me/e/2j85)

- ```university_faculty_chk_2``` checks for '@' in the preferred email.

In [25]:
try:
    %sql insert into university_faculty \
        (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name) \
        values ('124', 'Donald', 'Ferguson', 'donald.ferguson@columbia.edu', \
                    'Adjunct Professor', '2010', 'dff10', 49, 'Ferg')
    print("Inserted")
except Exception as e:
    print("Got exception = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.
Inserted

In [23]:
try:
    %sql insert into university_faculty \
        (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name) \
        values ('125', 'Donald', 'Ferguson', 'donald.ferguson@columbia.edu', \
                    'Adjunct Professor', '2010', 'dff11', 51, 'Ferg')
    print("Inserted")
except Exception as e:
    print("Got exception = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception =  (pymysql.err.InternalError) (3819, "Check constraint 'university_faculty_chk_1' is violated.")
[SQL: insert into university_faculty          (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name)          values ('125', 'Donald', 'Ferguson', 'donald.ferguson@columbia.edu',                      'Adjunct Professor', '2010', 'dff11', 51, 'Ferg')]
(Background on this error at: http://sqlalche.me/e/2j85)

- Fergusons are not very smart.

In [26]:
try:
    %sql insert into university_faculty \
        (guid, first_name, last_name, preferred_email, title, hire_year, uni, iq, preferred_name) \
        values ('125', 'Donald', 'Ferguson', 'donald.ferguson@columbia.edu', \
                    'Adjunct Professor', '2010', 'dff11', 49, 'Ferg')
    print("Inserted")
except Exception as e:
    print("Got exception = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.
Inserted

# Complex Example: Part I -- Course Number

```
CREATE TABLE `courses` (
  `dept_code` char(4) NOT NULL,
  `faculty_code` enum('BC','C','E','F','G','V','W','X') NOT NULL,
  `level` enum('0','1','2','3','4','6','8','9') NOT NULL,
  `number` char(3) NOT NULL,
  `title` varchar(256) NOT NULL,
  `description` varchar(1204) NOT NULL,
  `course_number` varchar(64) GENERATED ALWAYS AS
      (concat(`dept_code`,`faculty_code`,`level`,`number`)) STORED NOT NULL,
  `credits` int NOT NULL,
  PRIMARY KEY (`course_number`),
  KEY `dept_idx` (`dept_code`),
  KEY `full_number_idx` (`faculty_code`,`level`,`number`),
  KEY `dept_and_level` (`dept_code`,`level`),
  KEY `dept_and_credit` (`dept_code`,`credits`),
  CONSTRAINT `courses_chk_1` CHECK ((`number` between _utf8mb4'000' and _utf8mb4'999')),
  CONSTRAINT `courses_chk_2` CHECK (((`credits` >= 0) and (`credits` <= 4)))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
```

- __NOTE:__ This is for example purposes. I have not tested all of this.

In [34]:
%%sql
    insert into courses(dept_code, faculty_code, level, number, title, description, credits)
        values('COMS','W','4','111','Introduction to Databases',
                'The worst experience of your life.', 3)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [35]:
%%sql
    insert into courses(dept_code, faculty_code, level, number, title, description, credits)
        values('COMS','E','6','156','Topics in SW Engineering: Cloud Computing',
                'So, you survived databases and want another terrifying experience.', 3)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [36]:
%sql select * from courses;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
2 rows affected.

[('COMS', 'E', '6', '156', 'Topics in SW Engineering: Cloud Computing', 'So, you survived databases and want another terrifying experience.', 'COMSE6156', 3),
 ('COMS', 'W', '4', '111', 'Introduction to Databases', 'The worst experience of your life.', 'COMSW4111', 3)]

- There are probably less than 5,000 academic staff at Columbia.


- This means there are probably less than 25,000 distinct courses.


- That is a tiny table and would probably not require indexes.


- But, we added some anyway.

- Why did I pick those indexes? I thought about some [user stories](https://en.wikipedia.org/wiki/User_story)

"In software development and product management, a user story is an informal, natural language description of one or more features of a software system. User stories are often written from the perspective of an end user or user of a system."

- One approach, ```In order to <receive benefit> as a <role>, I can <goal/desire>```


- Some of my user stories,
    1. In order to < complete my requirements > as a < student >, I can find courses by department and level.
    2. In order to < have enough credits this semester > as a < student >, I can find courses by departments and credits.
    3. ... ...

- Text query.

In [37]:
%%sql
    SELECT * FROM courses WHERE MATCH(title, description)
        AGAINST('terrifying' IN NATURAL LANGUAGE MODE)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('COMS', 'E', '6', '156', 'Topics in SW Engineering: Cloud Computing', 'So, you survived databases and want another terrifying experience.', 'COMSE6156', 3)]

In [38]:
%%sql
    SELECT * FROM courses WHERE MATCH(title, description)
        AGAINST('databases' IN NATURAL LANGUAGE MODE)

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
2 rows affected.

[('COMS', 'E', '6', '156', 'Topics in SW Engineering: Cloud Computing', 'So, you survived databases and want another terrifying experience.', 'COMSE6156', 3),
 ('COMS', 'W', '4', '111', 'Introduction to Databases', 'The worst experience of your life.', 'COMSW4111', 3)]

# Querying the Catalog

- Consider the following queries ...

In [40]:
%sql use lahmansbaseballdb;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

In [41]:
try:
    %sql use catdog;
except Exception as e:
    print("Got exception e = ", e.args[0])

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception e =  (pymysql.err.InternalError) (1049, "Unknown database 'catdog'")

- How does the query processor know which databases exist?

In [42]:
%sql select distinct table_schema from information_schema.tables;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
36 rows affected.

[('mysql',),
 ('information_schema',),
 ('performance_schema',),
 ('sys',),
 ('imdbnew',),
 ('COVID19',),
 ('E6156F20',),
 ('AAF20W4111',),
 ('classicmodelsnew',),
 ('AAE6156',),
 ('aaaaaNYG',),
 ('lahman2019new',),
 ('lahmansbaseballdb2',),
 ('db_book_new',),
 ('ColumbiaCourses',),
 ('northwinds',),
 ('oh_demo',),
 ('W4111GoTSolutionClean',),
 ('webshop',),
 ('w4111gothwraw',),
 ('W4111GoTHWClean',),
 ('imdbf20raw',),
 ('gotf20raw',),
 ('recitation',),
 ('gotoh',),
 ('aaaIMDBF20Fixed',),
 ('imdbf20v',),
 ('imdbrecitation',),
 ('aaaaS21Examples',),
 ('aaaa_simple_university',),
 ('lahmansbaseballdb',),
 ('aaaS21Private',),
 ('lahmansdb_to_clean',),
 ('harry_potter',),
 ('Foods',),
 ('CSVCatalog',)]

- How about ...

- Show me foreign keys related to Batting.

In [44]:
try:
    %sql insert into batting (playerid, yearid, teamid, stint, shoesize)\
        values('123', '2010', 'BOS', '1', 10)
except Exception as e:
    print("Got exception e = ", e.args[0])

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception e =  (pymysql.err.InternalError) (1054, "Unknown column 'shoesize' in 'field list'")

In [45]:
try:
    %sql insert into batting (playerid, yearid, teamid, stint, H)\
        values('123', '2010', 'BOS', '1', 10)
except Exception as e:
    print("Got exception e = ", e.args[0])

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception e =  (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`lahmansbaseballdb`.`batting`, CONSTRAINT `batting_ibfk_3` FOREIGN KEY (`playerID`) REFERENCES `people` (`playerID`))')

In [46]:
try:
    %sql insert into batting (playerid, yearid, teamid, stint, H)\
        values('willite01', '2010', 'BOS', '1', "Yellow")
except Exception as e:
    print("Got exception e = ", e.args[0])

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
Got exception e =  (pymysql.err.InternalError) (1366, "Incorrect integer value: 'Yellow' for column 'H' at row 1")

- How did the database query processor know:
    - Shoesize is not a valid column?
    - There is a foreign key constraint that it needs to check?
    - The column H must be an integer?

In [48]:
%%sql
    select table_name, column_name, data_type from information_schema.columns where
        table_schema='lahmansbaseballdb' and table_name='batting'

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
25 rows affected.

[('batting', '2B', 'smallint'),
 ('batting', '3B', 'smallint'),
 ('batting', 'AB', 'smallint'),
 ('batting', 'BB', 'smallint'),
 ('batting', 'CS', 'smallint'),
 ('batting', 'G', 'smallint'),
 ('batting', 'G_batting', 'smallint'),
 ('batting', 'GIDP', 'smallint'),
 ('batting', 'H', 'smallint'),
 ('batting', 'HBP', 'smallint'),
 ('batting', 'HR', 'smallint'),
 ('batting', 'IBB', 'smallint'),
 ('batting', 'ID', 'int'),
 ('batting', 'lgID', 'char'),
 ('batting', 'playerID', 'varchar'),
 ('batting', 'R', 'smallint'),
 ('batting', 'RBI', 'smallint'),
 ('batting', 'SB', 'smallint'),
 ('batting', 'SF', 'smallint'),
 ('batting', 'SH', 'smallint'),
 ('batting', 'SO', 'smallint'),
 ('batting', 'stint', 'smallint'),
 ('batting', 'team_ID', 'int'),
 ('batting', 'teamID', 'char'),
 ('batting', 'yearID', 'smallint')]

In [49]:
%%sql
SELECT 
  TABLE_NAME,COLUMN_NAME,CONSTRAINT_NAME, REFERENCED_TABLE_NAME,REFERENCED_COLUMN_NAME
FROM
  INFORMATION_SCHEMA.KEY_COLUMN_USAGE
WHERE
  TABLE_SCHEMA = 'lahmansbaseballdb' AND
  TABLE_NAME = 'batting' or REFERENCED_TABLE_NAME = 'batting';

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
7 rows affected.

[('batting', 'ID', 'PRIMARY', None, None),
 ('batting', 'playerID', 'playerID', None, None),
 ('batting', 'yearID', 'playerID', None, None),
 ('batting', 'stint', 'playerID', None, None),
 ('batting', 'lgID', 'batting_ibfk_1', 'leagues', 'lgID'),
 ('batting', 'team_ID', 'batting_ibfk_2', 'teams', 'ID'),
 ('batting', 'playerID', 'batting_ibfk_3', 'people', 'playerID')]

- __Note:__ That is missing some foreign keys.

- Show me constraints related to Batting.

In [14]:
%%sql
select * from information_schema.table_constraints
	where
		constraint_schema='lahmansbaseballdb'
		and 
        table_name = 'batting';

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
5 rows affected.

[('def', 'lahmansbaseballdb', 'PRIMARY', 'lahmansbaseballdb', 'batting', 'PRIMARY KEY', 'YES'),
 ('def', 'lahmansbaseballdb', 'playerID', 'lahmansbaseballdb', 'batting', 'UNIQUE', 'YES'),
 ('def', 'lahmansbaseballdb', 'batting_ibfk_1', 'lahmansbaseballdb', 'batting', 'FOREIGN KEY', 'YES'),
 ('def', 'lahmansbaseballdb', 'batting_ibfk_2', 'lahmansbaseballdb', 'batting', 'FOREIGN KEY', 'YES'),
 ('def', 'lahmansbaseballdb', 'batting_ibfk_3', 'lahmansbaseballdb', 'batting', 'FOREIGN KEY', 'YES')]

- How about columns?

In [17]:
%%sql
select * from information_schema.columns
	where
		table_schema='lahmansbaseballdb'
		and 
        table_name = 'batting';

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
25 rows affected.

[('def', 'lahmansbaseballdb', 'batting', '2B', 13, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', '3B', 14, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'AB', 10, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'BB', 19, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'CS', 18, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'G', 8, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'G_batting', 9, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'GIDP', 25, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'H', 12, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'HBP', 22, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'HR', 15, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'IBB', 21, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'ID', 1, None, 'NO', 'int', None, None, 10, 0, None, None, None, 'int', 'PRI', 'auto_increment', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'lgID', 7, None, 'YES', 'char', 2, 8, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'char(2)', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'playerID', 2, None, 'NO', 'varchar', 9, 36, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(9)', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'R', 11, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'RBI', 16, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'SB', 17, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'SF', 24, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'SH', 23, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'SO', 20, None, 'YES', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'stint', 4, None, 'NO', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'team_ID', 6, None, 'YES', 'int', None, None, 10, 0, None, None, None, 'int', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'teamID', 5, None, 'YES', 'char', 3, 12, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'char(3)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahmansbaseballdb', 'batting', 'yearID', 3, None, 'NO', 'smallint', None, None, 5, 0, None, None, None, 'smallint', '', '', 'select,insert,update,references', '', '', None)]

# Worked Example -- Person, Student, Faculty

## Part I - Some Basic Steps

- Draft table definitions.


```
CREATE TABLE `person_three` (
  `first_name` varchar(128) NOT NULL,
  `last_name` varchar(128) NOT NULL,
  `preferred_email` varchar(256) DEFAULT NULL,
  `uni` varchar(12) NOT NULL,
  `uni_email` varchar(256) GENERATED ALWAYS AS (concat(`uni`,_utf8mb4'@columbia.edu')) STORED,
  `preferred_name` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`uni`),
  UNIQUE KEY `uni_email_UNIQUE` (`uni_email`),
  CONSTRAINT `person_three_chk_2` CHECK (((`preferred_email` is null) or 
		((`preferred_email` like _utf8mb4'%@%') and (not((`preferred_email` like _utf8mb4'%@%@%'))))))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

CREATE TABLE `faculty_three` (
  `uni` varchar(12) NOT NULL,
  `hire_date` year NOT NULL,
  `title` enum('Adjunct Professor','Associate Professor','Assistant Professor','Professor','Professor of Practice','Lecturer','Senior Lecturer') NOT NULL,
  PRIMARY KEY (`uni`),
  CONSTRAINT `faculty_person` FOREIGN KEY (`uni`) REFERENCES `person_three` (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

CREATE TABLE `student_three` (
  `uni` varchar(12) NOT NULL,
  `major` varchar(4) NOT NULL,
  PRIMARY KEY (`uni`),
  CONSTRAINT `student_person` FOREIGN KEY (`uni`) REFERENCES `person_three` (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

```

- Compute the UNI

In [51]:
%sql select aaaa_simple_university.generate_uni('Donald', 'Ferguson') as new_uni;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('dofe0',)]

In [52]:
%%sql
INSERT INTO `aaaa_simple_university`.`person_three`
(`first_name`,
`last_name`,
`preferred_email`,
`uni`,
`preferred_name`)
VALUES
('Donald', 'Ferguson', 'dff@cs.columbia.edu', 'dofe0', 'Ferg')

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [53]:
%%sql
INSERT INTO `aaaa_simple_university`.`faculty_three`
(uni, hire_date, title)
VALUES
('dofe0', '2004', 'Adjunct Professor');

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

- What would the next UNI be?

In [54]:
%sql select aaaa_simple_university.generate_uni('Donald', 'Ferguson') as new_uni;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('dofe1',)]

- Looks good, but I had to manually copy the UNI from cell to cell. Is there a better way?


- You can set variables.

In [58]:
%%sql
    set @new_uni := aaaa_simple_university.generate_uni('Donald', 'Ferguson')

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

In [59]:
%sql select @new_uni

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('dofe1',)]

In [61]:
%%sql
INSERT INTO `aaaa_simple_university`.`person_three`
(`first_name`,
`last_name`,
`preferred_email`,
`uni`,
`preferred_name`)
VALUES
('Donald', 'Ferguson', 'dff@mars.gov', @new_uni, 'Ferg')

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [62]:
%%sql
INSERT INTO `aaaa_simple_university`.`faculty_three`
(uni, hire_date, title)
VALUES
(@new_uni, '2004', 'Adjunct Professor');

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [77]:
%%sql
    use aaaa_simple_university;
    select * from person_three;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.
5 rows affected.

[('Donald', 'Ferguson', 'dff@cs.columbia.edu', 'dofe0', 'dofe0@columbia.edu', 'Ferg'),
 ('Donald', 'Ferguson', 'dff@mars.gov', 'dofe1', 'dofe1@columbia.edu', 'Ferg'),
 ('Donald', 'Ferguson', 'dff@mordor.mil', 'dofe2', 'dofe2@columbia.edu', 'Ferg'),
 ('Donald', 'Ferguson', 'sauron@foo.cat', 'dofe3', 'dofe3@columbia.edu', 'Eddie'),
 ('Donald', 'Ferguson', 'mouse@foo.cat', 'dofe4', 'dofe4@columbia.edu', 'Eddie')]

- Would be kind of cool if we could do this all at once. We can.

In [66]:
%%sql
     set @new_uni := aaaa_simple_university.generate_uni('Donald', 'Ferguson');
        
    INSERT INTO `aaaa_simple_university`.`person_three`
        (`first_name`,
        `last_name`,
        `preferred_email`,
        `uni`,
        `preferred_name`)
        VALUES
        ('Donald', 'Ferguson', 'dff@mordor.mil', @new_uni, 'Ferg');

   
    INSERT INTO `aaaa_simple_university`.`faculty_three`
        (uni, hire_date, title)
        VALUES
        (@new_uni, '2004', 'Adjunct Professor');

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.
1 rows affected.
1 rows affected.

[]

- You will sometimes hear the term "SQL script." 

"A SQL script is a set of SQL commands saved as a file in SQL Scripts. A SQL script can contain one or more SQL statements or PL/SQL blocks." 


- The files usually end in ```.sql``` Some of the load files you have used are SQL Scripts.


- Moving on. OK, but what if I want all of the information about a faculty in one query? Does everyone have to use two tables?

In [78]:
%sql select * from person_three natural join faculty_three;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
5 rows affected.

[('dofe0', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'dofe0@columbia.edu', 'Ferg', 2004, 'Adjunct Professor'),
 ('dofe1', 'Donald', 'Ferguson', 'dff@mars.gov', 'dofe1@columbia.edu', 'Ferg', 2004, 'Adjunct Professor'),
 ('dofe2', 'Donald', 'Ferguson', 'dff@mordor.mil', 'dofe2@columbia.edu', 'Ferg', 2004, 'Adjunct Professor'),
 ('dofe3', 'Donald', 'Ferguson', 'sauron@foo.cat', 'dofe3@columbia.edu', 'Eddie', 2009, 'Professor'),
 ('dofe4', 'Donald', 'Ferguson', 'mouse@foo.cat', 'dofe4@columbia.edu', 'Eddie', 2009, 'Professor')]

- That is a pretty common query. Would be awesome if we had a view.

In [69]:
%sql create or replace view faculty_three_all as select * from person_three natural join faculty_three;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

In [70]:
%sql select * from faculty_three_all;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
3 rows affected.

[('dofe0', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'dofe0@columbia.edu', 'Ferg', 2004, 'Adjunct Professor'),
 ('dofe1', 'Donald', 'Ferguson', 'dff@mars.gov', 'dofe1@columbia.edu', 'Ferg', 2004, 'Adjunct Professor'),
 ('dofe2', 'Donald', 'Ferguson', 'dff@mordor.mil', 'dofe2@columbia.edu', 'Ferg', 2004, 'Adjunct Professor')]

## Procedures

- Having to use that script everywhere is kind of klunky.


- We can put it all together into a procedure.

```
CREATE DEFINER=`root`@`localhost`
    PROCEDURE `create_faculty_three_all`(
        in first_name varchar(64),
        in last_name varchar(64),
        in preferred_email varchar(256),
        in preferred_name varchar(64),
        in hire_date year(4),
        in title varchar(128))
        
BEGIN

	declare new_uni varchar(12);
    
	set new_uni = generate_uni(first_name, last_name);
        
    INSERT INTO `aaaa_simple_university`.`person_three`
        (`first_name`,
        `last_name`,
        `preferred_email`,
        `uni`,
        `preferred_name`)
        VALUES
        (first_name, last_name, preferred_email, new_uni, preferred_name);

   
    INSERT INTO `aaaa_simple_university`.`faculty_three`
        (uni, hire_date, title)
        VALUES
        (new_uni, hire_date, title);

END

```

- And, let's call the procedure!

In [71]:
%%sql
call aaaa_simple_university.create_faculty_three_all
    ('Donald', 'Ferguson', 'mouse@foo.cat', 'Eddie', 2009, 'Professor');

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[]

__Return to Presentation.__

# Security Examples

- Create a user identity and authentication password for students to access the database.

In [79]:
%sql create user example_student identified  by "dbuserdbuser";

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

- We will not allow ```example_student``` and privileges, and will explicitly add what the student needs.

In [82]:
%sql revoke all PRIVILEGES on *.* from example_student;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.

[]

- I am going to connect to the database on a different connection to simulate connecting as ```example_student.```

In [87]:
%sql mysql+pymysql://example_student:dbuserdbuser@localhost

'Connected: example_student@None'

- Now use that connection.

In [88]:
%%sql
    example_student@localhost show databases;

1 rows affected.

[('information_schema',)]

- The user cannot even see what databases there are.